import React from "react";
import ReactDOM from "react-dom/client";
import { ThreeDChart } from "smart-webcomponents-react/threedchart";

class App extends React.Component {
  dataSource = [{ "Date": "1/2/2019", "S&P 500": "1831.98", "NASDAQ": "4143.07", "uid": 0 }, { "Date": "1/3/2019", "S&P 500": "1831.37", "NASDAQ": "4131.91", "uid": 1 }, { "Date": "1/6/2019", "S&P 500": "1826.77", "NASDAQ": "4113.68", "uid": 2 }, { "Date": "1/7/2019", "S&P 500": "1837.88", "NASDAQ": "4153.18", "uid": 3 }, { "Date": "1/8/2019", "S&P 500": "1837.49", "NASDAQ": "4165.61", "uid": 4 }, { "Date": "1/9/2019", "S&P 500": "1838.13", "NASDAQ": "4156.19", "uid": 5 }, { "Date": "1/10/2019", "S&P 500": "1842.37", "NASDAQ": "4174.67", "uid": 6 }, { "Date": "1/13/2019", "S&P 500": "1819.2", "NASDAQ": "4113.3", "uid": 7 }, { "Date": "1/14/2019", "S&P 500": "1838.88", "NASDAQ": "4183.02", "uid": 8 }, { "Date": "1/15/2019", "S&P 500": "1848.38", "NASDAQ": "4214.88", "uid": 9 }, { "Date": "1/16/2019", "S&P 500": "1845.89", "NASDAQ": "4218.69", "uid": 10 }, { "Date": "1/17/2019", "S&P 500": "1838.7", "NASDAQ": "4197.58", "uid": 11 }, { "Date": "1/21/2019", "S&P 500": "1843.8", "NASDAQ": "4225.76", "uid": 12 }, { "Date": "1/22/2019", "S&P 500": "1844.86", "NASDAQ": "4243", "uid": 13 }, { "Date": "1/23/2019", "S&P 500": "1828.46", "NASDAQ": "4218.88", "uid": 14 }, { "Date": "1/24/2019", "S&P 500": "1790.29", "NASDAQ": "4128.17", "uid": 15 }, { "Date": "1/27/2019", "S&P 500": "1781.56", "NASDAQ": "4083.61", "uid": 16 }, { "Date": "1/28/2019", "S&P 500": "1792.5", "NASDAQ": "4097.96", "uid": 17 }, { "Date": "1/29/2019", "S&P 500": "1774.2", "NASDAQ": "4051.43", "uid": 18 }, { "Date": "1/30/2019", "S&P 500": "1794.19", "NASDAQ": "4123.13", "uid": 19 }, { "Date": "1/31/2019", "S&P 500": "1782.59", "NASDAQ": "4103.88", "uid": 20 }, { "Date": "2/3/2019", "S&P 500": "1741.89", "NASDAQ": "3996.96", "uid": 21 }, { "Date": "2/4/2019", "S&P 500": "1755.2", "NASDAQ": "4031.52", "uid": 22 }, { "Date": "2/5/2019", "S&P 500": "1751.64", "NASDAQ": "4011.55", "uid": 23 }, { "Date": "2/6/2019", "S&P 500": "1773.43", "NASDAQ": "4057.12", "uid": 24 }, { "Date": "2/7/2019", "S&P 500": "1797.02", "NASDAQ": "4125.86", "uid": 25 }, { "Date": "2/10/2019", "S&P 500": "1799.84", "NASDAQ": "4148.17", "uid": 26 }, { "Date": "2/11/2019", "S&P 500": "1819.75", "NASDAQ": "4191.05", "uid": 27 }, { "Date": "2/12/2019", "S&P 500": "1819.26", "NASDAQ": "4201.29", "uid": 28 }, { "Date": "2/13/2019", "S&P 500": "1829.83", "NASDAQ": "4240.67", "uid": 29 }, { "Date": "2/14/2019", "S&P 500": "1838.63", "NASDAQ": "4244.02", "uid": 30 }, { "Date": "2/18/2019", "S&P 500": "1840.76", "NASDAQ": "4272.78", "uid": 31 }, { "Date": "2/19/2019", "S&P 500": "1828.75", "NASDAQ": "4237.95", "uid": 32 }, { "Date": "2/20/2019", "S&P 500": "1839.78", "NASDAQ": "4267.55", "uid": 33 }, { "Date": "2/21/2019", "S&P 500": "1836.25", "NASDAQ": "4263.41", "uid": 34 }, { "Date": "2/24/2019", "S&P 500": "1847.61", "NASDAQ": "4292.97", "uid": 35 }, { "Date": "2/25/2019", "S&P 500": "1845.12", "NASDAQ": "4287.59", "uid": 36 }, { "Date": "2/26/2019", "S&P 500": "1845.16", "NASDAQ": "4292.06", "uid": 37 }, { "Date": "2/27/2019", "S&P 500": "1854.29", "NASDAQ": "4318.93", "uid": 38 }, { "Date": "2/28/2019", "S&P 500": "1859.45", "NASDAQ": "4308.12", "uid": 39 }, { "Date": "3/3/2019", "S&P 500": "1845.73", "NASDAQ": "4277.3", "uid": 40 }, { "Date": "3/4/2019", "S&P 500": "1873.91", "NASDAQ": "4351.97", "uid": 41 }, { "Date": "3/5/2019", "S&P 500": "1873.81", "NASDAQ": "4357.97", "uid": 42 }, { "Date": "3/6/2019", "S&P 500": "1877.03", "NASDAQ": "4352.13", "uid": 43 }, { "Date": "3/7/2019", "S&P 500": "1878.04", "NASDAQ": "4336.22", "uid": 44 }, { "Date": "3/10/2019", "S&P 500": "1877.17", "NASDAQ": "4334.45", "uid": 45 }, { "Date": "3/11/2019", "S&P 500": "1867.63", "NASDAQ": "4307.19", "uid": 46 }, { "Date": "3/12/2019", "S&P 500": "1868.2", "NASDAQ": "4323.33", "uid": 47 }, { "Date": "3/13/2019", "S&P 500": "1846.34", "NASDAQ": "4260.42", "uid": 48 }, { "Date": "3/14/2019", "S&P 500": "1841.13", "NASDAQ": "4245.4", "uid": 49 }, { "Date": "3/17/2019", "S&P 500": "1858.83", "NASDAQ": "4279.95", "uid": 50 }, { "Date": "3/18/2019", "S&P 500": "1872.25", "NASDAQ": "4333.31", "uid": 51 }, { "Date": "3/19/2019", "S&P 500": "1860.77", "NASDAQ": "4307.6", "uid": 52 }, { "Date": "3/20/2019", "S&P 500": "1872.01", "NASDAQ": "4319.29", "uid": 53 }, { "Date": "3/21/2019", "S&P 500": "1866.52", "NASDAQ": "4276.79", "uid": 54 }, { "Date": "3/24/2019", "S&P 500": "1857.44", "NASDAQ": "4226.39", "uid": 55 }, { "Date": "3/25/2019", "S&P 500": "1865.62", "NASDAQ": "4234.27", "uid": 56 }, { "Date": "3/26/2019", "S&P 500": "1852.56", "NASDAQ": "4173.58", "uid": 57 }, { "Date": "3/27/2019", "S&P 500": "1849.04", "NASDAQ": "4151.23", "uid": 58 }, { "Date": "3/28/2019", "S&P 500": "1857.62", "NASDAQ": "4155.76", "uid": 59 }, { "Date": "3/31/2019", "S&P 500": "1872.34", "NASDAQ": "4198.99", "uid": 60 }, { "Date": "4/1/2019", "S&P 500": "1885.52", "NASDAQ": "4268.04", "uid": 61 }, { "Date": "4/2/2019", "S&P 500": "1890.9", "NASDAQ": "4276.46", "uid": 62 }, { "Date": "4/3/2019", "S&P 500": "1888.77", "NASDAQ": "4237.74", "uid": 63 }, { "Date": "4/4/2019", "S&P 500": "1865.09", "NASDAQ": "4127.73", "uid": 64 }, { "Date": "4/7/2019", "S&P 500": "1845.04", "NASDAQ": "4079.75", "uid": 65 }, { "Date": "4/8/2019", "S&P 500": "1851.96", "NASDAQ": "4112.99", "uid": 66 }, { "Date": "4/9/2019", "S&P 500": "1872.18", "NASDAQ": "4183.9", "uid": 67 }, { "Date": "4/10/2019", "S&P 500": "1833.08", "NASDAQ": "4054.11", "uid": 68 }, { "Date": "4/11/2019", "S&P 500": "1815.69", "NASDAQ": "3999.73", "uid": 69 }, { "Date": "4/14/2019", "S&P 500": "1830.61", "NASDAQ": "4022.69", "uid": 70 }, { "Date": "4/15/2019", "S&P 500": "1842.98", "NASDAQ": "4034.16", "uid": 71 }, { "Date": "4/16/2019", "S&P 500": "1862.31", "NASDAQ": "4086.23", "uid": 72 }, { "Date": "4/17/2019", "S&P 500": "1864.85", "NASDAQ": "4095.52", "uid": 73 }, { "Date": "4/21/2019", "S&P 500": "1871.89", "NASDAQ": "4121.55", "uid": 74 }, { "Date": "4/22/2019", "S&P 500": "1879.55", "NASDAQ": "4161.46", "uid": 75 }, { "Date": "4/23/2019", "S&P 500": "1875.39", "NASDAQ": "4126.97", "uid": 76 }, { "Date": "4/24/2019", "S&P 500": "1878.61", "NASDAQ": "4148.34", "uid": 77 }, { "Date": "4/25/2019", "S&P 500": "1863.4", "NASDAQ": "4075.56", "uid": 78 }, { "Date": "4/28/2019", "S&P 500": "1869.43", "NASDAQ": "4074.4", "uid": 79 }, { "Date": "4/29/2019", "S&P 500": "1878.33", "NASDAQ": "4103.54", "uid": 80 }, { "Date": "4/30/2019", "S&P 500": "1883.95", "NASDAQ": "4114.56", "uid": 81 }, { "Date": "5/1/2019", "S&P 500": "1883.68", "NASDAQ": "4127.45", "uid": 82 }, { "Date": "5/2/2019", "S&P 500": "1881.14", "NASDAQ": "4123.9", "uid": 83 }, { "Date": "5/5/2019", "S&P 500": "1884.66", "NASDAQ": "4138.06", "uid": 84 }, { "Date": "5/6/2019", "S&P 500": "1867.72", "NASDAQ": "4080.76", "uid": 85 }, { "Date": "5/7/2019", "S&P 500": "1878.21", "NASDAQ": "4067.67", "uid": 86 }, { "Date": "5/8/2019", "S&P 500": "1875.63", "NASDAQ": "4051.5", "uid": 87 }, { "Date": "5/9/2019", "S&P 500": "1878.48", "NASDAQ": "4071.87", "uid": 88 }, { "Date": "5/12/2019", "S&P 500": "1896.65", "NASDAQ": "4143.86", "uid": 89 }, { "Date": "5/13/2019", "S&P 500": "1897.45", "NASDAQ": "4130.17", "uid": 90 }, { "Date": "5/14/2019", "S&P 500": "1888.53", "NASDAQ": "4100.63", "uid": 91 }, { "Date": "5/15/2019", "S&P 500": "1870.85", "NASDAQ": "4069.29", "uid": 92 }, { "Date": "5/16/2019", "S&P 500": "1877.86", "NASDAQ": "4090.59", "uid": 93 }, { "Date": "5/19/2019", "S&P 500": "1885.08", "NASDAQ": "4125.81", "uid": 94 }, { "Date": "5/20/2019", "S&P 500": "1872.83", "NASDAQ": "4096.89", "uid": 95 }, { "Date": "5/21/2019", "S&P 500": "1888.03", "NASDAQ": "4131.54", "uid": 96 }, { "Date": "5/22/2019", "S&P 500": "1892.49", "NASDAQ": "4154.34", "uid": 97 }, { "Date": "5/23/2019", "S&P 500": "1900.53", "NASDAQ": "4185.81", "uid": 98 }, { "Date": "5/27/2019", "S&P 500": "1911.91", "NASDAQ": "4237.07", "uid": 99 }, { "Date": "5/28/2019", "S&P 500": "1909.78", "NASDAQ": "4225.08", "uid": 100 }, { "Date": "5/29/2019", "S&P 500": "1920.03", "NASDAQ": "4247.95", "uid": 101 }, { "Date": "5/30/2019", "S&P 500": "1923.57", "NASDAQ": "4242.62", "uid": 102 }, { "Date": "6/2/2019", "S&P 500": "1924.97", "NASDAQ": "4237.2", "uid": 103 }, { "Date": "6/3/2019", "S&P 500": "1924.24", "NASDAQ": "4234.08", "uid": 104 }, { "Date": "6/4/2019", "S&P 500": "1927.88", "NASDAQ": "4251.64", "uid": 105 }, { "Date": "6/5/2019", "S&P 500": "1940.46", "NASDAQ": "4296.23", "uid": 106 }, { "Date": "6/6/2019", "S&P 500": "1949.44", "NASDAQ": "4321.4", "uid": 107 }, { "Date": "6/9/2019", "S&P 500": "1951.27", "NASDAQ": "4336.24", "uid": 108 }, { "Date": "6/10/2019", "S&P 500": "1950.79", "NASDAQ": "4338", "uid": 109 }, { "Date": "6/11/2019", "S&P 500": "1943.89", "NASDAQ": "4331.93", "uid": 110 }, { "Date": "6/12/2019", "S&P 500": "1930.11", "NASDAQ": "4297.63", "uid": 111 }, { "Date": "6/13/2019", "S&P 500": "1936.16", "NASDAQ": "4310.65", "uid": 112 }, { "Date": "6/16/2019", "S&P 500": "1937.78", "NASDAQ": "4321.1", "uid": 113 }, { "Date": "6/17/2019", "S&P 500": "1941.99", "NASDAQ": "4337.23", "uid": 114 }, { "Date": "6/18/2019", "S&P 500": "1956.98", "NASDAQ": "4362.84", "uid": 115 }, { "Date": "6/19/2019", "S&P 500": "1959.48", "NASDAQ": "4359.33", "uid": 116 }, { "Date": "6/20/2019", "S&P 500": "1962.87", "NASDAQ": "4368.04", "uid": 117 }, { "Date": "6/23/2019", "S&P 500": "1962.61", "NASDAQ": "4368.68", "uid": 118 }, { "Date": "6/24/2019", "S&P 500": "1949.98", "NASDAQ": "4350.35", "uid": 119 }];

    caption = 'ביצועי מדד שוק המניות בארה"ב';

    description = 'NASDAQ Composite לעומת S&P 500';

    showLegend = true;

    colorScheme = 'scheme32';

    cameraPosition = {
      x: 15,
      y: 12,
      z: 50,
    };

    xAxis = {
      dataField: 'Date',
      formatFunction: function (value) {
          return value.getDate() + '/' + (value.getMonth().toString().length==1?'0':'')+(value.getMonth()+1);
      },
      type: 'date',
      labels: {
          step: 2,
      }
    };

    valueAxis = {
      visible: true,
      unitInterval: 500,
      formatSettings: { decimalPlaces: 0 },
      minValue: 1000,
    };

    gridOptions = {
      slotWidthZ: 17,
      width: 120,
      height: 60
    };

    seriesGroups =[
      {
          type: 'line',
          series: [
              { dataField: 'S&P 500', displayText: 'S&P 500' },
              { dataField: 'NASDAQ', displayText: 'NASDAQ' }
          ]
      }
    ];
    messages = {
        "he": {
        'resetCamera': 'מיקום ברירת מחדל',
        'cameraMode': 'מצב מצלמה',
        'panMode': 'מצב פאן',
        'zoomMode': 'מצב זום',
        'saveImage': 'שמור תמונה',
        'zoomOut': 'להקטין את התצוגה',
        'zoomIn': 'לְהִתְמַקֵד',}
    };

  init() {}

  componentDidMount() {}

  render() {
    return (
      <div>
        <ThreeDChart
          id="chart"
          caption={this.caption}
          description={this.description}
          xAxis={this.xAxis}
          valueAxis={this.valueAxis}
          showLegend={this.showLegend}
          colorScheme={this.colorScheme}
          seriesGroups={this.seriesGroups}
          legendLayout={this.legendLayout}
          cameraPosition={this.cameraPosition}
          dataSource={this.dataSource}
          gridOptions={this.gridOptions}
          messages={this.messages}
          rightToLeft={true}
          locale={"he"}
        ></ThreeDChart>
      </div>
    );
  }
}

export default App;
